package lesson_1_tasks;

/*
Вывести на экран текст «Silence is golden». Каждое слово должно быть на новой строке.
 **/

public class Task_1 {
    public static void main(String[] args) {

        //1 вариант
        System.out.println("Silence");
        System.out.println("is");
        System.out.println("golden");

        //2 вариант
        System.out.println();
        System.out.print("Silence \nis \ngolden");

    }
}
